create database BFDB
use BFDB 

/*Vegetables的数据*/
insert into Vegetables
values('v1', '黄花菜', '秋季', 1, 0.5),
('v2', '菜豆', '夏季', 2, 1.2),
('v3', '甜椒', '春季', 2, 1),
('v4', '香椿', '冬季', 0.4, 0.01),
('v5', '茴香', '四级', 1.5, 0.5),
('v6', '芹菜', '夏季', 3, 1.8),
('v7', '苦瓜', '夏季', 2.5, 1.5)

/*Business的数据*/
insert into Business
values('b1','不会倒闭的小店','羊肠小道','1234567890'),
('b2','随便卖卖小店','羊肠大道','0987654321'),
('b3','各种肉类专卖店','羊肠中道','1111111111'),
('b4','只有周末卖的店','羊肠二道','2222222222'),
('b5','你爱买不买的店','羊肠三道','3333333333')

/*BVB的数据*/
insert into BVB
values('b1','v1',101),
('b1','v3',300),
('b1','v5',100),
('b1','v6',101),
('b2','v1',101),
('b2','v3',300),
('b2','v4',600),
('b2','v7',700),
('b3','v1',500),
('b3','v2',400),
('b3','v3',100),
('b4','v1',150)
insert into BVB(Bno, Vno)
values('b1','v2'),
('b1','v4')

